# -*- coding: utf-8 -*-
# FileName: plants_data.py
# Time : 2023/6/6 20:58
# Author: zzy
# 存储三种植物的数据


PLANTS_DESCRIPTION = {
    "葡萄黑腐病":
        """
        葡萄黑腐病（Grapevine black rot）是真菌病害，在东北、华北等地发生较多，一般为害不重，在长江以南地区，如遇连续高温高湿天气，则发病较重，如1991年遇到特大洪涝灾害后，
不少园子均发生了程度不一的黑腐病。

        """
    ,
    "番茄叶斑病":
        """
        番茄灰叶斑病，只为害叶片，发病初期叶面布满暗色圆形或不正圆形小斑点，后沿叶脉向四周扩大，呈不规则形，中部渐褪为灰白至灰褐色。
        """
    ,
    "苹果黑星病":
        """
        苹果黑星病又称苹果疮痂病、黑点病，是由苹果黑星菌侵染所引起的、发生在苹果上的病害。主要危害叶片或果实，叶柄、果柄、花芽、花器及新梢，从落花期到苹果成熟期均可危害。
        """
    ,
    "玉米大斑病":
        """
        玉米大斑病是一种常见的玉米病害，由真菌引起。
        该病的症状主要表现为玉米叶片上出现大型圆形或椭圆形的黑色斑点，斑点周围常有黄色或白色边界。严重感染可能导致叶片枯干和凋萎。
        """
    ,
    "玉米灰斑病":
        """
        玉米灰斑病是一种由真菌引起的玉米病害。它的症状包括叶片上出现灰色的细小斑点，后来扩大并融合成大型灰色斑块。
        感染严重时，叶片可能变黄并枯死，从而影响植株的生长和产量。
        """
    ,
    "玉米锈病":
        """
        玉米锈病是一种常见的玉米病害，由真菌引起。感染后，
        叶片表面会出现橙色至棕色的小斑点，这些小斑点会逐渐扩大并形成红色或棕色的锈病斑。
        严重感染会导致叶片凋萎、干枯和产量减少。及早防治是控制玉米锈病的关键。
        """
    ,
    "玉米钻心虫病":
        """
        玉米钻心虫病是由玉米钻心虫引起的病害。成虫钻孔产卵在玉米茎部或叶片上，导致幼虫孵化后进入植株内部进行破坏。
        这会导致玉米植株受损、生长迟缓，严重时可能引起茎部折断或减产。
        """
    ,
    "健康":
        """
        您的玉米植株状态良好，未发现任何疾病或异常症状。继续保持良好的生长条件，可以促进玉米的健康生长和丰收。
        """
    ,
    "其他":
        """
        根据分析, 这张图片似乎不是植物相关的内容.也可能此植株模型暂未公开不提供识别功能, 敬请期待.
        """
}
